#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Fri Sep 22 13:27:18 2023

add_design "E:/PDS/ip_1port_ram/rtl/ip_1port_ram.v"
add_design "E:/PDS/ip_1port_ram/rtl/ram_rw.v"
add_design E:/PDS/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
add_simulation "E:/PDS/ip_1port_ram/sim/tb/tb_ip_1port_ram.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
add_constraint "E:/PDS/ip_1port_ram/prj/ip_1port_ram.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_simulation "E:/PDS/ip_1port_ram/sim/tb/tb_ip_1port_ram.v"
add_simulation "E:/PDS/ip_1port_ram/sim/tb/ip_1port_ram_tb.v"
remove_simulation "E:/PDS/ip_1port_ram/sim/tb/ip_1port_ram_tb.v"
add_simulation "E:/PDS/ip_1port_ram/sim/tb/tb_ip_1port_ram.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
add_fic "E:/PDS/ip_1port_ram/prj/synthesize/ip_1port_ram_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
