#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Wed Oct 11 10:47:08 2023

add_design "D:/Desktop/50G/29_top_lcd_touch/rtl/lcd_rgb_char/binary2bcd.v"
add_design "D:/Desktop/50G/29_top_lcd_touch/rtl/lcd_rgb_char/clk_div.v"
add_design "D:/Desktop/50G/29_top_lcd_touch/rtl/lcd_rgb_char/lcd_display.v"
add_design "D:/Desktop/50G/29_top_lcd_touch/rtl/lcd_rgb_char/lcd_driver.v"
add_design "D:/Desktop/50G/29_top_lcd_touch/rtl/lcd_rgb_char/lcd_rgb_char.v"
add_design "D:/Desktop/50G/29_top_lcd_touch/rtl/lcd_rgb_char/rd_id.v"
add_design "D:/Desktop/50G/29_top_lcd_touch/rtl/touch/touch_top.v"
add_design "D:/Desktop/50G/29_top_lcd_touch/rtl/touch/touch_dri.v"
add_design "D:/Desktop/50G/29_top_lcd_touch/rtl/touch/i2c_dri.v"
add_design "D:/Desktop/50G/29_top_lcd_touch/rtl/top_lcd_touch.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
add_fic "D:/Desktop/50G/29_top_lcd_touch/prj/synthesize/top_lcd_touch_syn.fic"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "D:/Desktop/50G/29_top_lcd_touch/prj/top_lcd_touch.fdc"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_lcd_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
