#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Thu Oct 12 12:12:34 2023

add_design "D:/Desktop/50G/31_digital_voltmeter/rtl/clk_div.v"
add_design "D:/Desktop/50G/31_digital_voltmeter/rtl/lcd_disp_char.v"
add_design "D:/Desktop/50G/31_digital_voltmeter/rtl/lcd_display.v"
add_design "D:/Desktop/50G/31_digital_voltmeter/rtl/lcd_driver.v"
add_design "D:/Desktop/50G/31_digital_voltmeter/rtl/rd_id.v"
add_design "D:/Desktop/50G/31_digital_voltmeter/rtl/test_voltage.v"
add_design "D:/Desktop/50G/31_digital_voltmeter/rtl/top_dvm.v"
add_design "D:/Desktop/50G/31_digital_voltmeter/rtl/voltage_calibrator.v"
add_design "D:/Desktop/50G/31_digital_voltmeter/rtl/voltage_data.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dvm
add_constraint "D:/Desktop/50G/31_digital_voltmeter/prj/digital_voltmeter.fdc"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dvm
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dvm
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dvm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_dvm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
