//****************************************Copyright (c)***********************************//
//原子哥在线教学平台：www.yuanzige.com
//技术支持：http://www.openedv.com/forum.php
//淘宝店铺：https://zhengdianyuanzi.tmall.com
//关注微信公众平台微信号："正点原子"，免费获取ZYNQ & FPGA & STM32 & LINUX资料。
//版权所有，盗版必究。
//Copyright(C) 正点原子 2023-2033
//All rights reserved                                  
//----------------------------------------------------------------------------------------
// File name:           led
// Created by:          正点原子
// Created date:        2023年3月30日09:40:02
// Version:             V1.0
// Descriptions:        点亮LED灯实验
//
//----------------------------------------------------------------------------------------
//****************************************************************************************//

module led(                     
    input     key , //输入按键
    
    output    led   //输出led灯
);

//*****************************************************
//**                  main code
//*****************************************************

//上电按键默认高电平，led灯保持常灭
//按键被按下，按键值为低电平，led灯被点亮
assign led = ~key;    //将按键的值取反后赋值给led灯

endmodule