#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Fri Oct 13 11:24:01 2023

add_design "D:/Desktop/33_hs_dual_da/rtl/da_wave_send.v"
add_design "D:/Desktop/33_hs_dual_da/rtl/hs_dual_da.v"
add_design D:/Desktop/33_hs_dual_da/prj/ipcore/pll_clk/pll_clk.idf
add_design D:/Desktop/33_hs_dual_da/prj/ipcore/rom_1024x10b/rom_1024x10b.idf
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_dual_da
add_constraint "D:/Desktop/33_hs_dual_da/prj/hs_dual_da.fdc"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_dual_da
synthesize -ads -selected_syn_tool_opt 2 
add_fic "D:/Desktop/33_hs_dual_da/prj/synthesize/hs_dual_da_syn.fic"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_dual_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_dual_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic -force"D:/Desktop/33_hs_dual_da/prj/synthesize/hs_dual_da_syn.fic"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_dual_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_dual_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module hs_dual_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
