#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Thu Oct 12 13:40:11 2023

add_design "D:/Desktop/50G/32_dds/rtl/da_wave_send.v"
add_design "D:/Desktop/50G/32_dds/rtl/dds.v"
add_design "D:/Desktop/50G/32_dds/rtl/key_debounce.v"
add_design D:/Desktop/50G/32_dds/prj/ipcore/pll_clk/pll_clk.idf
add_design D:/Desktop/32_dds/prj/ipcore/rom_400x8b/rom_400x8b.idf
add_design D:/Desktop/32_dds/prj/ipcore/ram/ram.idf
remove_design -force D:/Desktop/32_dds/prj/ipcore/rom_400x8b/rom_400x8b.idf
remove_design -force D:/Desktop/32_dds/prj/ipcore/ram/ram.idf
add_design D:/Desktop/32_dds/prj/ipcore/rom_400x8b/rom_400x8b.idf
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
add_constraint "D:/Desktop/32_dds/prj/dds.fdc"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
add_fic "D:/Desktop/32_dds/prj/synthesize/dds_syn.fic"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "D:/Desktop/32_dds/sim/tb/tb_dds.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic "D:/Desktop/32_dds/prj/synthesize/dds_syn.fic"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/Desktop/32_dds/prj/synthesize/dds_syn.fic"
remove_fic "D:/Desktop/32_dds/prj/synthesize/dds_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
add_fic "D:/Desktop/32_dds/prj/synthesize/dds_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_simulation "D:/Desktop/32_dds/sim/tb/tb_dds.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dds
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
