#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Wed Sep 20 10:16:56 2023

add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/udp/udp.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/udp/udp_rx.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/udp/udp_tx.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/eth_ctrl.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/eth_udp_loop.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/arp/arp.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/arp/arp_rx.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/arp/arp_tx.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/arp/crc32_d8.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/gmii_to_rgmii/gmii_to_rgmii.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/gmii_to_rgmii/rgmii_rx.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/gmii_to_rgmii/rgmii_tx.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/icmp/icmp.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/icmp/icmp_rx.v"
add_design "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/rtl/icmp/icmp_tx.v"
add_design C:/Users/Admin/Desktop/25G/4_eth_udp_loop/prj/ipcore/clk_wiz_0/clk_wiz_0.idf
add_design C:/Users/Admin/Desktop/25G/4_eth_udp_loop/prj/ipcore/sync_fifo_2048x8b/sync_fifo_2048x8b.idf
add_design C:/Users/Admin/Desktop/25G/4_eth_udp_loop/prj/ipcore/pll_sft/pll_sft.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_udp_loop
add_constraint "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/prj/eth_udp_loop.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_udp_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "C:/Users/Admin/Desktop/25G/4_eth_udp_loop/sim/tb/tb_udp.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_udp_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_udp_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force C:/Users/Admin/Desktop/25G/4_eth_udp_loop/prj/ipcore/clk_wiz_0/clk_wiz_0.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_udp_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_udp_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
