#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Fri Sep 29 15:34:02 2023

add_design "E:/PDS/uart_loopback/rtl/uart_loopback.v"
add_design "E:/PDS/uart_loopback/rtl/uart_rx.v"
add_design "E:/PDS/uart_loopback/rtl/uart_tx.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module uart_loopback
add_constraint "E:/PDS/uart_loopback/prj/uart_loopback.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module uart_loopback
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "E:/PDS/uart_loopback/sim/tb/tb_uart_loopback.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module uart_loopback
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
