#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Fri Oct  6 14:28:07 2023

set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "E:/Document/FPGA/PGL/PGL50G/Test program/top_dual_ov5640_hdmi/rtl/hdmi_top/hdmi_disply.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
remove_design -force E:/Document/FPGA/PGL/PGL25G/Finalized/top_dual_ov5640_hdmi/prj/ipcore/ddr3_ip/ddr3_ip.idf
add_design E:/Document/FPGA/PGL/PGL25G/Finalized/top_dual_ov5640_hdmi/prj/ipcore/ddr3_ip/ddr3_ip.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_dual_ov5640_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
