#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Mon Sep 18 13:48:25 2023

add_design "D:/Desktop/3_mux2_1/rtl/mux2_1.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module mux2_1
add_constraint "D:/Desktop/3_mux2_1/prj/mux2_1.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "D:/Desktop/3_mux2_1/sim/tb_mux2_1.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module mux2_1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module mux2_1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mux2_1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
