#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Mon Sep 18 15:35:53 2023

add_design "D:/Desktop/5_latch/rtl/latch.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -multi_file_compilation_unit false -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -allow_duplicate_modules -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -fsm_compiler {off} -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "D:/Desktop/5_latch/rtl/latch.v"
remove_simulation "D:/Desktop/5_latch/rtl/latch.v"
add_simulation "D:/Desktop/5_latch/sim/tb_latch.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module latch
