#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Wed Sep 13 14:59:26 2023

add_design E:/PDS/ip_pll/prj/ipcore/pll_clk/pll_clk.idf
add_design "E:/PDS/ip_pll/rtl/ip_pll.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_pll
add_constraint "E:/PDS/ip_pll/prj/ip_pll.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "E:/PDS/ip_pll/sim/tb/tb_ip_pll.v"
remove_simulation "E:/PDS/ip_pll/sim/tb/tb_ip_pll.v"
add_simulation "E:/PDS/ip_pll/sim/tb/tb_ip_pll.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
