#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Sat Sep 23 17:41:00 2023

remove_design -verilog "D:/ywd/dmdps2/rtl/i2c_dri.v"
remove_design -verilog "D:/ywd/dmdps2/rtl/pcf8563_ctrl.v"
remove_design -verilog "D:/ywd/dmdps2/rtl/top_rtc_lcd.v"
remove_design -verilog "D:/ywd/dmdps2/rtl/lcd_rgb_char/clk_div.v"
remove_design -verilog "D:/ywd/dmdps2/rtl/lcd_rgb_char/lcd_driver.v"
remove_design -verilog "D:/ywd/dmdps2/rtl/lcd_rgb_char/lcd_display.v"
remove_design -verilog "D:/ywd/dmdps2/rtl/lcd_rgb_char/lcd_rgb_char.v"
remove_design -verilog "D:/ywd/dmdps2/rtl/lcd_rgb_char/rd_id.v"
add_design "D:/ywd/dmdps2/rtc_lcd/rtl/i2c_dri.v"
add_design "D:/ywd/dmdps2/rtc_lcd/rtl/pcf8563_ctrl.v"
add_design "D:/ywd/dmdps2/rtc_lcd/rtl/top_rtc_lcd.v"
add_design "D:/ywd/dmdps2/rtc_lcd/rtl/lcd_rgb_char/clk_div.v"
add_design "D:/ywd/dmdps2/rtc_lcd/rtl/lcd_rgb_char/lcd_display.v"
add_design "D:/ywd/dmdps2/rtc_lcd/rtl/lcd_rgb_char/lcd_driver.v"
add_design "D:/ywd/dmdps2/rtc_lcd/rtl/lcd_rgb_char/lcd_rgb_char.v"
add_design "D:/ywd/dmdps2/rtc_lcd/rtl/lcd_rgb_char/rd_id.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/ywd/dmdps2/rtc_lcd/prj/synthesize/top_rtc_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic -force"D:/ywd/dmdps2/rtc_lcd/prj/synthesize/top_rtc_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_rtc_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
