#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Tue Sep 19 13:41:21 2023

add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/eth_ctrl.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/eth_icmp_test.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/icmp/icmp.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/icmp/icmp_rx.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/icmp/icmp_tx.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/gmii_to_rgmii/gmii_to_rgmii.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/gmii_to_rgmii/rgmii_rx.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/gmii_to_rgmii/rgmii_tx.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/arp/arp.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/arp/arp_rx.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/arp/arp_tx.v"
add_design "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/rtl/arp/crc32_d8.v"
add_design C:/Users/Admin/Desktop/25G/50_eth_icmp_test/prj/ipcore/pll_sft/pll_sft.idf
add_design C:/Users/Admin/Desktop/25G/50_eth_icmp_test/prj/ipcore/clk_wiz_0/clk_wiz_0.idf
add_design C:/Users/Admin/Desktop/25G/50_eth_icmp_test/prj/ipcore/sync_fifo_2048x8b/sync_fifo_2048x8b.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
add_constraint "C:/Users/Admin/Desktop/25G/50_eth_icmp_test/prj/eth_icmp_test.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/sim/tb_icmp.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/eth_ctrl.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/eth_icmp_test.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/icmp/icmp.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/icmp/icmp_rx.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/icmp/icmp_tx.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/gmii_to_rgmii/gmii_to_rgmii.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/gmii_to_rgmii/rgmii_rx.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/gmii_to_rgmii/rgmii_tx.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/arp/arp.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/arp/arp_rx.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/arp/arp_tx.v"
add_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/arp/crc32_d8.v"
remove_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/eth_icmp_test.v"
remove_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/gmii_to_rgmii/gmii_to_rgmii.v"
remove_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/eth_ctrl.v"
remove_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/arp/arp.v"
remove_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/gmii_to_rgmii/rgmii_tx.v"
remove_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/gmii_to_rgmii/rgmii_rx.v"
remove_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/arp/arp_tx.v"
remove_simulation "C:/Users/Admin/Desktop/25G/3_eth_icmp_test/rtl/arp/arp_rx.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force C:/Users/Admin/Desktop/25G/3_eth_icmp_test/prj/ipcore/clk_wiz_0/clk_wiz_0.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_icmp_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
