#Generated by Fabric Compiler ( version 2021.4-SP1.2 <build 96435> ) at Wed Nov 30 13:43:24 2022

set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design E:/pango/Verilog/MIPI_DSI/mipi_dsi_colorbar_touch/prj/ipcore/sync_fifo_128x32b/sync_fifo_128x32b.idf
add_design E:/pango/Verilog/MIPI_DSI/mipi_dsi_colorbar_touch/prj/ipcore/sync_fifo_256x32b/sync_fifo_256x32b.idf
remove_design -force E:/pango/Verilog/MIPI_DSI/mipi_dsi_colorbar_touch/prj/ipcore/sync_fifo_128x32b/sync_fifo_128x32b.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force -verilog "E:/pango/Verilog/mipi_dsi_colorbar_touch/rtl/drm_32x512.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar_touch
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "D:/pgl22/mipi_dsi_colorbar_touch/rtl/mipi_dsi_colorbar_touch.v"
remove_design -verilog "D:/pgl22/mipi_dsi_colorbar_touch/rtl/dsi_display.v"
add_design "D:/pgl22/mipi_dsi_colorbar_touch/rtl/mipi_display.v"
add_design "D:/pgl22/mipi_dsi_colorbar_touch/rtl/mipi_dsi_colorbar.v"
add_design "D:/pgl22/mipi_dsi_colorbar_touch/rtl/mipi_rd_id.v"
add_design "D:/pgl22/mipi_dsi_colorbar_touch/rtl/mipi_dsi_packet/timing_para_gen.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
remove_design -force -verilog "D:/pgl22/mipi_dsi_colorbar_touch/rtl/mipi_rd_id.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint  -logic -fdc "D:/pgl22/mipi_dsi_colorbar/prj/mipi_dsi_colorbar_touch.fdc"
add_constraint "D:/pgl22/mipi_dsi_colorbar/prj/mipi_dsi_colorbar.fdc"
remove_design -force -verilog "D:/pgl22/mipi_dsi_colorbar/rtl/touch_top/touch_top.v"
remove_design -force -verilog "D:/pgl22/mipi_dsi_colorbar/rtl/touch_top/i2c_dri_m.v"
remove_design -force -verilog "D:/pgl22/mipi_dsi_colorbar/rtl/touch_top/touch_dri.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_design -force D:/PGL25/MIPI/DSI/mipi_dsi_colorbar/prj/ipcore/pll_clk_hs/pll_clk_hs.idf
add_design "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar/prj/ipcore/pll_clk_hs/pll_clk_hs.idf"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_design -force D:/PGL25/MIPI/DSI/mipi_dsi_colorbar/prj/ipcore/pll_clk_hs/pll_clk_hs.idf
add_design D:/PGL25/MIPI/DSI/mipi_dsi_colorbar/prj/ipcore/pll_clk_hs/pll_clk_hs.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_design -force D:/PGL25/MIPI/DSI/mipi_dsi_colorbar/prj/ipcore/pll_clk_pixel/pll_clk_pixel.idf
add_design "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar/prj/ipcore/pll_clk_pixel/pll_clk_pixel.idf"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint  -logic -fdc "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25_1/prj/mipi_dsi_colorbar.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_hs_pkt
synthesize -ads -disable_io_insertion -selected_syn_tool_opt 2 
add_constraint "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25_1/prj/mipi_dsi_colorbar.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
add_design "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25__original/rtl/mipi_dsi_packet/ecc1.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25__key/rtl/mipi_dsi_packet/crc16_d32.v"
remove_design -verilog "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25__key/rtl/mipi_dsi_packet/mipi_dsi_hs_pkt.v"
remove_design -verilog "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25__key/rtl/mipi_dsi_packet/packet_data_ctrl.v"
remove_design -verilog "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25__key/rtl/mipi_dsi_packet/rgb2byte_4lane.v"
remove_design -verilog "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25__key/rtl/mipi_dsi_packet/timing_para_gen.v"
remove_design -verilog "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25__key/rtl/mipi_dsi_packet/ecc1.v"
add_design "D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25__key/rtl/mipi_dsi_packet/mipi_dsi_hs_pkt_syn.vm"
remove_design -force D:/PGL25/MIPI/DSI/mipi_dsi_colorbar_25__key/prj/ipcore/async_fifo_1024x32b/async_fifo_1024x32b.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mipi_dsi_colorbar
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
