#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Wed Oct 11 20:01:18 2023

add_design "D:/Desktop/50G/30_hs_ad_da/rtl/da_wave_send.v"
add_design "D:/Desktop/50G/30_hs_ad_da/rtl/hs_ad_da.v"
add_design D:/Desktop/50G/30_hs_ad_da/prj/ipcore/pll_clk/pll_clk.idf
remove_design -force D:/Desktop/50G/30_hs_ad_da/prj/ipcore/pll_clk/pll_clk.idf
add_design D:/Desktop/50G/30_hs_ad_da/prj/ipcore/pll_clk/pll_clk.idf
remove_design -force D:/Desktop/50G/30_hs_ad_da/prj/ipcore/pll_clk/pll_clk.idf
add_design "D:/Desktop/50G/30_hs_ad_da/rtl/hs_ad_da.v"
add_design "D:/Desktop/50G/30_hs_ad_da/rtl/da_wave_send.v"
add_design "D:/Desktop/50G/30_hs_ad_da/rtl/ad_wave_rec.v"
add_design D:/Desktop/50G/30_hs_ad_da/prj/ipcore/rom_256x8b/rom_256x8b.idf
remove_design -force D:/Desktop/50G/30_hs_ad_da/prj/ipcore/rom_256x8b/rom_256x8b.idf
add_design D:/Desktop/30_hs_ad_da/prj/ipcore/rom_256x8b/rom_256x8b.idf
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
add_constraint "D:/Desktop/30_hs_ad_da/prj/hs_ad_da.fdc"
synthesize -ads -selected_syn_tool_opt 2 
add_fic "D:/Desktop/30_hs_ad_da/prj/synthesize/hs_ad_da_syn.fic"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/Desktop/30_hs_ad_da/prj/ipcore/pll_clk/pll_clk.idf
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force -verilog "D:/Desktop/30_hs_ad_da/rtl/ad_wave_rec.v"
remove_fic -force"D:/Desktop/30_hs_ad_da/prj/synthesize/hs_ad_da_syn.fic"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
add_fic "D:/Desktop/30_hs_ad_da/prj/synthesize/hs_ad_da_syn.fic"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module hs_ad_da
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
