#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Tue Sep 19 14:58:10 2023

set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/ywd/dmpds/ceshi/sd_bmp_lcd/prj/synthesize/sd_bmp_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "D:/ywd/dmdps1/sd_bmp_lcd/rtl/lcd_rgb_top/lcd_rgb_top.v"
add_design "D:/ywd/dmdps1/sd_bmp_lcd/rtl/hdmi_top/asyn_rst_syn.v"
add_design "D:/ywd/dmdps1/sd_bmp_lcd/rtl/hdmi_top/dvi_encoder.v"
add_design "D:/ywd/dmdps1/sd_bmp_lcd/rtl/hdmi_top/dvi_transmitter_top.v"
add_design "D:/ywd/dmdps1/sd_bmp_lcd/rtl/hdmi_top/hdmi_top.v"
add_design "D:/ywd/dmdps1/sd_bmp_lcd/rtl/hdmi_top/serializer_10_to_1.v"
add_design "D:/ywd/dmdps1/sd_bmp_lcd/rtl/hdmi_top/video_driver.v"
remove_design D:/ywd/dmdps1/sd_bmp_lcd/prj/ipcore/pll_clk/pll_clk.idf
add_design "D:/ywd/dmdps1/sd_bmp_lcd/prj/ipcore/pll_clk/pll_clk.idf"
remove_fic "D:/ywd/dmdps1/sd_bmp_lcd/prj/synthesize/sd_bmp_lcd_syn.fic"
remove_design -verilog "D:/ywd/dmdps1/sd_bmp_lcd/rtl/lcd_rgb_top/clk_div.v"
remove_design -verilog "D:/ywd/dmdps1/sd_bmp_lcd/rtl/lcd_rgb_top/lcd_driver.v"
remove_design -verilog "D:/ywd/dmdps1/sd_bmp_lcd/rtl/lcd_rgb_top/rd_id.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/ywd/dmdps1/sd_bmp_lcd/prj/synthesize/sd_bmp_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "D:/ywd/dmdps1/sd_bmp_lcd/rtl/sd_ddr_size.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
remove_design D:/ywd/dmdps1/sd_bmp_lcd/prj/ipcore/pll_clk/pll_clk.idf
add_design D:/ywd/dmdps1/sd_bmp_lcd/prj/ipcore/pll_clkk/pll_clkk.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic "D:/ywd/dmdps1/sd_bmp_hdmi/prj/synthesize/sd_bmp_lcd_syn.fic"
remove_constraint  -logic -fdc "D:/ywd/dmdps1/sd_bmp_hdmi/prj/source/sd_bmp_lcd.fdc"
remove_design -verilog "D:/ywd/dmdps1/sd_bmp_hdmi/rtl/sd_bmp_lcd.v"
add_design "D:/ywd/dmdps1/sd_bmp_hdmi/rtl/sd_bmp_hdmi.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_constraint "D:/ywd/dmdps1/sd_bmp_hdmi/prj/source/sd_bmp_hdmi.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/ywd/dmdps1/sd_bmp_hdmi/prj/synthesize/sd_bmp_hdmi_syn.fic"
remove_design D:/ywd/dmdps1/sd_bmp_hdmi/prj/ipcore/pll_clkk/pll_clkk.idf
add_design "D:/ywd/dmdps1/sd_bmp_hdmi/prj/ipcore/pll_clk/pll_clk.idf"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic -force"D:/ywd1/dm/sd_bmp_hdmi/prj/synthesize/sd_bmp_hdmi_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module sd_bmp_hdmi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
