#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Tue Sep 12 15:02:48 2023

add_design "D:/Desktop/led/rtl/led.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module led
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module led
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module led
add_constraint "D:/Desktop/led/prj/led.fdc"
remove_constraint -force -logic -fdc "D:/Desktop/led/prj/led.fdc"
add_constraint "D:/Desktop/led/prj/led.fdc"
remove_constraint -force -logic -fdc "D:/Desktop/led/prj/led.fdc"
add_constraint "D:/Desktop/led/prj/source/led.fdc"
remove_constraint -force -logic -fdc "D:/Desktop/led/prj/source/led.fdc"
add_constraint "D:/Desktop/led/prj/source/led.fdc"
synthesize -dir {} -ads -selected_syn_tool_opt 2 
synthesize -dir {} -ads -selected_syn_tool_opt 2 
synthesize -dir {} -ads -selected_syn_tool_opt 2 
synthesize -dir {} -ads -selected_syn_tool_opt 2 
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module led
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module led
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
