#Generated by Fabric Compiler ( version 2021.4-SP1.2 <build 96435> ) at Thu Aug 31 17:25:40 2023

dev_map 
dev_map 
dev_map 
dev_map 
dev_map 
dev_map 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
dev_map 
dev_map 
dev_map 
dev_map 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic -force"C:/Users/ALIENTEK/Desktop/licheng/Test/Ziguang/PGL25G/ov5640_lcd_d0/prj/synthesize/ov5640_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design C:/Users/ALIENTEK/Desktop/licheng/Test/Ziguang/PGL25G/bank/ov5640_lcd/prj/ipcore/pll/pll.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "E:/Document/FPGA/PGL/PGL25G/Finalized/ov5640_lcd/prj/synthesize/ov5640_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic "E:/Document/FPGA/PGL/PGL25G/Finalized/ov5640_lcd/prj/synthesize/ov5640_lcd_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "E:/Document/FPGA/PGL/PGL25G/Finalized/ov5640_lcd/prj/synthesize/ov5640_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic "E:/Document/FPGA/PGL/PGL25G/Finalized/ov5640_lcd/prj/synthesize/ov5640_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "E:/Document/FPGA/PGL/PGL25G/Finalized/ov5640_lcd/prj/synthesize/ov5640_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
remove_fic "E:/Document/FPGA/PGL/PGL25G/Finalized/ov5640_lcd/prj/synthesize/ov5640_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_design "D:/Desktop/25G/ov5640_lcd_yuv/rtl/vip/vip.v"
add_design "D:/Desktop/25G/ov5640_lcd_yuv/rtl/vip/rgb2ycbcr.v"
add_design "D:/Desktop/25G/ov5640_lcd_yuv/rtl/ov5640_lcd_yuv.v"
remove_design -verilog "D:/Desktop/25G/ov5640_lcd_yuv/rtl/ov5640_lcd.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd_yuv
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd_yuv
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd_yuv
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd_yuv
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint -force -logic -fdc "D:/Desktop/25G/ov5640_lcd_yuv/prj/source/ov5640_lcd_pin.fdc"
add_constraint "D:/Desktop/25G/ov5640_lcd_yuv/prj/source/ov5640_lcd_pin.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd_yuv
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/ddr3_ctrl_top/aq_axi_master.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/ddr3_ctrl_top/ctrl_fifo.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/ddr3_ctrl_top/ddr3_ctrl_top.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/ddr3_ctrl_top/ddr3_rw_ctrl.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/lcd_rgb_top/clk_div.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/lcd_rgb_top/lcd_driver.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/lcd_rgb_top/lcd_rgb_top.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/lcd_rgb_top/rd_id.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/ov5640_dri/cmos_capture_data.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/ov5640_dri/i2c_dri.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/ov5640_dri/i2c_ov5640_rgb565_cfg.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/ov5640_dri/ov5640_dri.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/vip/rgb2ycbcr.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/vip/vip.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/ov5640_lcd_yuv.v"
add_design "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/rtl/picture_size.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/picture_size.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/ov5640_dri/cmos_capture_data.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/ov5640_dri/i2c_dri.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/ov5640_dri/i2c_ov5640_rgb565_cfg.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/lcd_rgb_top/clk_div.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/lcd_rgb_top/lcd_driver.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/lcd_rgb_top/rd_id.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/ddr3_ctrl_top/aq_axi_master.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/ddr3_ctrl_top/ctrl_fifo.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/ddr3_ctrl_top/ddr3_rw_ctrl.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/ddr3_ctrl_top/ddr3_ctrl_top.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/lcd_rgb_top/lcd_rgb_top.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/ov5640_dri/ov5640_dri.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/vip/vip.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/vip/rgb2ycbcr.v"
remove_design -verilog "D:/ywd/dps4/ccccccccccc/pm/25G/25G/ov5640_lcd_yuv/prj/rtl/ov5640_lcd_yuv.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd_yuv
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ov5640_lcd_yuv
synthesize -dir {} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
