#Generated by Fabric Compiler ( version 2021.4-SP1.2 <build 96435> ) at Sat Aug 20 15:27:44 2022

add_design "C:/Users/Admin/Desktop/Pango/top_e2prom/rtl/e2prom_top.v"
add_design "C:/Users/Admin/Desktop/Pango/top_e2prom/rtl/i2c_dri.v"
add_design "C:/Users/Admin/Desktop/Pango/top_e2prom/rtl/led_alarm.v"
add_design "C:/Users/Admin/Desktop/Pango/top_e2prom/rtl/e2prom_rw.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "C:/Users/Admin/Desktop/Pango/top_e2prom/prj/top_e2prom.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module e2prom_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_e2prom
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "D:/ywd/dmdps1/23_top_e2prom/rtl/e2prom_top.v"
remove_design -verilog "D:/ywd/dmdps1/23_top_e2prom/rtl/led_alarm.v"
add_design "D:/ywd/dmdps1/23_top_e2prom/rtl/rw_result_led.v"
add_design "D:/ywd/dmdps1/23_top_e2prom/rtl/top_e2prom.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_e2prom
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
