#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Mon Sep 25 14:19:36 2023

add_design "D:/Desktop/11_key_led/rtl/key_led.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module key_led
add_constraint "D:/Desktop/11_key_led/prj/key_led.fdc"
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module key_led
add_simulation "D:/Desktop/11_key_led/sim/key_led.v"
remove_simulation "D:/Desktop/11_key_led/sim/key_led.v"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "D:/Desktop/11_key_led/sim/tb/tb_key_led.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module key_led
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module key_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
