#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Fri Oct  6 18:30:08 2023

set_arch -family Logos -device PGL50G -speedgrade -6 -package FBG484
compile -top_module top_hdmi_block_move
set_arch -family Logos -device PGL50G -speedgrade -6 -package FBG484
compile -top_module top_hdmi_block_move
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_hdmi_block_move
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module top_hdmi_block_move
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "E:/Document/FPGA/PGL/PGL50G/Test program/hdmi_block_move/sim/tb_top_hdmi_block_move.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_hdmi_block_move
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_hdmi_block_move
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
