#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Fri Sep 22 13:20:01 2023

add_constraint "D:/Desktop/10_flow_led/prj/flow_led.fdc"
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "D:/Desktop/10_flow_led/sim/tb/tb_flow_led.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
