#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Mon Sep 18 15:16:23 2023

add_design "C:/Users/Admin/Desktop/25G/mdio_rw_test/rtl/mdio_ctrl.v"
add_design "C:/Users/Admin/Desktop/25G/mdio_rw_test/rtl/mdio_dri.v"
add_design "C:/Users/Admin/Desktop/25G/mdio_rw_test/rtl/mdio_rw_test.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mdio_rw_test
add_constraint "C:/Users/Admin/Desktop/25G/mdio_rw_test/prj/mdio_rw_test.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mdio_rw_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mdio_rw_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mdio_rw_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "C:/Users/Admin/Desktop/25G/mdio_rw_test/sim/mdio_slave_interface.v"
add_simulation "C:/Users/Admin/Desktop/25G/mdio_rw_test/sim/tb_mdio_rw_test.v"
add_simulation "C:/Users/Admin/Desktop/25G/mdio_rw_test/rtl/mdio_ctrl.v"
add_simulation "C:/Users/Admin/Desktop/25G/mdio_rw_test/rtl/mdio_dri.v"
add_simulation "C:/Users/Admin/Desktop/25G/mdio_rw_test/rtl/mdio_rw_test.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mdio_rw_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mdio_rw_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mdio_rw_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module mdio_rw_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
