#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Thu Sep 21 10:10:52 2023

add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/eth_ctrl.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/eth_ddr3_lcd.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/eth_top.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/picture_tailor.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/udp_data.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/arp/arp.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/arp/arp_rx.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/arp/arp_tx.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/arp/crc32_d8.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/ddr3/aq_axi_master.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/ddr3/ctrl_fifo.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/ddr3/ddr3_ctrl_top.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/ddr3/ddr3_rw_ctrl.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/gmii_to_rgmii/gmii_to_rgmii.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/gmii_to_rgmii/rgmii_rx.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/gmii_to_rgmii/rgmii_tx.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/icmp/icmp.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/icmp/icmp_rx.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/icmp/icmp_tx.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/lcd/clk_div.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/lcd/lcd_display.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/lcd/lcd_driver.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/lcd/lcd_rgb_top.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/lcd/rd_id.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/udp/udp.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/udp/udp_rx.v"
add_design "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/rtl/udp/udp_tx.v"
add_design C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/prj/ipcore/clk_wiz_0/clk_wiz_0.idf
add_design C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/prj/ipcore/ddr3_ip/ddr3_ip.idf
add_design C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/prj/ipcore/wr_fifo/wr_fifo.idf
add_design C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/prj/ipcore/rd_fifo/rd_fifo.idf
add_design C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/prj/ipcore/sync_fifo_2048x8b/sync_fifo_2048x8b.idf
add_design C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/prj/ipcore/pll_sft/pll_sft.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
add_constraint "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/prj/eth_ddr_lcd.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/prj/synthesize/eth_ddr3_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic -force"C:/Users/Admin/Desktop/25G/5_eth_ddr_lcd/prj/synthesize/eth_ddr3_lcd_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module eth_ddr3_lcd
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
