#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Sat Sep 30 17:01:04 2023

add_design "E:/PDS/rs485_key_led/rtl/rs485_key_led.v"
add_design "E:/PDS/rs485_key_led/rtl/uart_rx.v"
add_design "E:/PDS/rs485_key_led/rtl/led_ctrl.v"
add_design "E:/PDS/rs485_key_led/rtl/key_trig.v"
add_design "E:/PDS/rs485_key_led/rtl/key_debounce.v"
add_design "E:/PDS/rs485_key_led/rtl/uart_tx.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module rs485_key_led
add_constraint "E:/PDS/rs485_key_led/prj/rs485_key_led.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module rs485_key_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "E:/PDS/rs485_key_led/sim/tb/tb_rs485_key_led.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module rs485_key_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
