#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Fri Sep 15 15:11:40 2023

remove_design -verilog "D:/ywd/dmpds/rtl/sd_ctrl_top.v"
remove_design -verilog "D:/ywd/dmpds/rtl/led_alarm.v"
remove_design -verilog "D:/ywd/dmpds/rtl/data_gen.v"
remove_design -verilog "D:/ywd/dmpds/rtl/sd_init.v"
remove_design -verilog "D:/ywd/dmpds/rtl/sd_read.v"
remove_design -verilog "D:/ywd/dmpds/rtl/sd_write.v"
remove_design -verilog "D:/ywd/dmpds/rtl/top_sd_rw.v"
add_design "D:/ywd/dmpds/sd_rw/rtl/data_gen.v"
add_design "D:/ywd/dmpds/sd_rw/rtl/led_alarm.v"
add_design "D:/ywd/dmpds/sd_rw/rtl/sd_ctrl_top.v"
add_design "D:/ywd/dmpds/sd_rw/rtl/sd_init.v"
add_design "D:/ywd/dmpds/sd_rw/rtl/sd_read.v"
add_design "D:/ywd/dmpds/sd_rw/rtl/sd_write.v"
add_design "D:/ywd/dmpds/sd_rw/rtl/top_sd_rw.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/ywd/dmpds/sd_rw/prj/synthesize/top_sd_rw_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design D:/ywd/dmpds/sd_rw/prj/ipcore/clk_wiz_0/clk_wiz_0.idf
add_design D:/ywd/dmpds/sd_rw/prj/ipcore/pll_clk/pll_clk.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic -force"D:/ywd1/dm/sd_rw-25g/prj/synthesize/top_sd_rw_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module top_sd_rw
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
