#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Mon Sep 18 15:32:17 2023

add_design "D:/Desktop/2_gate/2_or_gate/rtl/or_gate.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module or_gate
add_constraint "D:/Desktop/2_gate/2_or_gate/prj/or_gate.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "D:/Desktop/2_gate/2_or_gate/sim/tb_or_gate.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module or_gate
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG324
compile -top_module or_gate
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module or_gate
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
