#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Wed Oct 11 17:59:25 2023

add_design E:/PDS/ip_fifo/prj/ipcore/async_fifo/async_fifo.idf
add_design "E:/PDS/ip_fifo/rtl/ip_fifo.v"
add_design E:/PDS/ip_fifo/prj/ipcore/pll_clk/pll_clk.idf
add_design "E:/PDS/ip_fifo/rtl/fifo_wr.v"
add_design "E:/PDS/ip_fifo/rtl/fifo_rd.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
add_constraint "E:/PDS/ip_fifo/prj/ip_fifo.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
add_fic "E:/PDS/ip_fifo/prj/synthesize/ip_fifo_syn.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "E:/PDS/ip_fifo/sim/tb/tb_ip_fifo.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
